## Plan Result (prod_shutter_static_webapp)




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;juror-bureau&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;juror-public&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;juror-bureau&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;juror-public&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;juror-bureau&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;juror-public&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;juror-bureau&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;juror-bureau&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;juror-public&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["juror-bureau"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apps.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["juror-public"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apps.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["juror-bureau"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.juror"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apps.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["juror-public"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.juror-public"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apps.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["juror-bureau"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "juror-bureau"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["juror-public"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "juror-public"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["juror-bureau"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "juror.apps.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["juror-public"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "juror-public.apps.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["juror-bureau"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "juror_bureau_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["juror-public"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "juror_public_prod"
      + updated_at      = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (7 unchanged elements hidden)
        {
            backend_domain      = [
                "pre-prod.powerappsportals.com",
            ]
            cache_enabled       = "false"
            certificate_name    = "www-portal-pre-recorded-evidence-justice-gov-uk"
            custom_domain       = "portal.pre-recorded-evidence.justice.gov.uk"
            custom_rules        = [
                {
                    action           = "Block"
                    enabled          = true
                    match_conditions = [
                        {
                            match_values       = [
                                "GB",
                            ]
                            match_variable     = "RemoteAddr"
                            negation_condition = true
                            operator           = "GeoMatch"
                        },
                    ]
                    name             = "CountryMatchWhitelist"
                    priority         = 1
                    type             = "MatchRule"
                },
            ]
            disabled_rules      = {
                RCE  = [
                    "932100",
                    "932110",
                    "932115",
                ]
                SQLI = [
                    "942440",
                    "942450",
                ]
            }
            dns_zone_name       = "pre-recorded-evidence.justice.gov.uk"
            forwarding_protocol = "HttpsOnly"
            health_path         = "/SignIn?ReturnUrl=%2F"
            health_protocol     = "Https"
            mode                = "Prevention"
            name                = "portal"
            shutter_app         = true
        },
      + {
          + backend_domain = [
              + "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
          + cache_enabled  = "false"
          + custom_domain  = "juror-public.apps.hmcts.net"
          + disabled_rules = {}
          + dns_zone_name  = "apps.hmcts.net"
          + name           = "juror-public"
        },
      + {
          + backend_domain = [
              + "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
          + cache_enabled  = "false"
          + custom_domain  = "juror.apps.hmcts.net"
          + custom_rules   = [
              + {
                  + action           = "Block"
                  + match_conditions = [
                      + {
                          + match_values       = [
                              + "194.33.192.0/24",
                              + "194.33.196.0/24",
                              + "194.33.200.0/21",
                              + "194.33.248.0/24",
                              + "194.33.249.0/24",
                              + "51.149.249.0/27",
                              + "51.149.249.32/27",
                              + "51.149.250.0/23",
                              + "20.58.23.145/32",
                            ]
                          + match_variable     = "RemoteAddr"
                          + negation_condition = true
                          + operator           = "IPMatch"
                        },
                    ]
                  + name             = "IPMatchWhitelist"
                  + priority         = 1
                  + type             = "MatchRule"
                },
            ]
          + disabled_rules = {}
          + dns_zone_name  = "apps.hmcts.net"
          + name           = "juror-bureau"
        },
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":669,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_static_webapp","Vars":{}} -->